import { Component, OnInit } from '@angular/core';
import { Post } from '../app.component';

@Component({
  selector: 'app-home',
  templateUrl: './home.component.html',
  styleUrls: ['./home.component.css']
})
export class HomeComponent implements OnInit {

  posts:Post[] = [
     {
      title: 'Real Time Embedded Linux',
      text: 'קורס C מהווה מדריך שלם לפיתוח תוכנה באמצעות לימוד שפת C , הקורס נועד ללימוד שפת C למתחילים וכן מתקדמים, הוא מעניק את הידע, הטכניקות והכלים הנדרשים בכדי לאפשר פיתוח תוכנות מסובכות ברמה מקצועית גבוהה בחברות הייטק לתחומים השונים לרבות פיתוח C for Embedded  - שניתן ממנו להמשיך למסלול מלא של פיתוח Real Time Embedded Linux'
    },
    {
      title: 'QA & Automation',
      text: 'עולם פיתוח התוכנה מתקדם בצורה מהירה ואיתו גם תחום בדיקות התוכנה QA ופיתוח כלי אוטומציה.היום יותר מתמיד יש תחרות בינלאומית גדולה ודרישה לביצוע תהליכי פיתוח מהירים ויעלים תוך שמירה על איכות גבוהה של המוצרים.בהתאם לכך יש כמובן דרישה מאוד גדולה התעשיית הייטק לעובדים מיומנים בבדיקות QA והמכללה שלנו מציע את הקורס הכי מקיף ומעשי בארץ לבדיקות תוכנה כולל התמחות בפיתוח כלי אוטומציה.'
    },
    {
      title: 'Full Stack Web Development',
      text: 'קורס Full Stack מעניק את כלל הידע, הניסיון והכלים הנדרשים לסטודנט בכדי להצטרף לצוות פיתוח בחברות המובילות במשק כמפתח צד שרת (Server) וצד לקוח (Client).המסלול הכולל את כל הקורסים אשר נועדו להעניק לך את הידע והניסיון המקצועי הנדרשים במגוון טכנולוגיות מתקדמות, לרבות שפות תכנות ופלטפורמות כגון:CSS3, Javascript, MySQL, NodeJS, React, AngularJS ועוד.'
    },
    {
      title: 'Cyber',
      text: 'ה CEH הבינלאומית.  קורס אבטחת מידע וסייבר מעניק להאקר את היכולת להגן על מערכות ה- IT שלו, כולל רשתות, תוכניות, אתרי אינטרנט, מסדי נתונים וכו .  במסגרת קורס סייבר המועמדים ילמדו בסביבה אינטראקטיבית שבה הם ילמדו כיצד לסרוק, לבדוק, ולאבטח את המערכות שלהם. סביבה כזו תעניק לכל תלמיד ידע מעמיק וניסיון מעשי במערכות האבטחה המהותיות הקיימות.'
    },
    {
      title: 'DevOps',
      text: 'מחקרים רבים מוכיחים ששוק העובדים בהייטק לא יוכל לתת מענה בשנים קרובות לביקוש הגדול בתעשייה לאנשי DevOps.ישנה התקדמות טכנולוגית גדולה ומהירה, מעבר לאפליקציות אוןליין, וייעול של כלל התהליכים של פיתוח ותחזוקת מוצרים.  אנשי הדבאופס אחראים בין היתר על פיתוח ותפעול כלי בדיקות מוצרים, ניהול משאבים , והם למעשה הדבק שמחבר את כל העוסקים בפרוייקט, בגלל עובדות אלו ועוד יש ביקוש גדול בתשייה לעובדים מיומנים וכך צפוי להיות גם בעתיד.'
    },
    {
      title: 'Linux Admin',
      text: 'קורס לינוקס הוא קורס מקיף ומעשי הכולל לימודי Linux Admin ובנוסף לימודי Bash Scripting,לינוקס היא מערכת ההפעלה אשר בנויה בקוד פתוח ונמצאת בשימוש מאוד רחב בתעשייה ולמגוון מטרות ולטובת התמקצעות בלינוקס הכנו תכנית הלימודים מקיפה ופרקטית אשר נותנת דגש רב לביצוע תרגול וצבירת ניסיון מעשי,  בעזרת החומר הנלמד בקורס ניתן לשלוט במערכת ההפעלה לינוקס ולעבוד עם Bash ברמה הגבוהה ביותר ולבצע קשת רחבה של פעולות לפי צורך המוצר או הפרויקט.'
    }
 ]

  constructor() { }

  ngOnInit() {
  }

}
